#!/usr/bin/env python3

original_array = [2, 8, 9, 48, 8, 22, -12, 2]

new_array = []
for num in original_array:
    if num > 5:
        new_array.append(num + 2)

print(original_array)
print(new_array)

# #!/usr/bin/env python3
# # บอกคอมพิวเตอร์ (ระบบปฏิบัติการ) ว่าให้รันไฟล์นี้ด้วยโปรแกรม Python 3


# original_array = [2, 8, 9, 48, 8, 22, -12, 2]
# # สร้างตัวแปรชื่อ original_array เพื่อเก็บชุดตัวเลขตั้งต้นเอาไว้

# new_array = []
# # สร้างกล่องอาร์เรย์เปล่าๆ ชื่อ new_array เตรียมไว้รอเก็บผลลัพธ์ตัวเลขใหม่

# for num in original_array:
# # สั่งให้โปรแกรมดึงตัวเลขจาก original_array ออกมาทีละ 1 ตัว (โดยให้ตัวเลขที่ดึงมาในรอบนั้นมีชื่อว่า num)

#     if num > 5:
#     # สร้างเงื่อนไขตรวจสอบเพิ่มเติมว่า ตัวเลข num ในรอบนั้น มีค่า "มากกว่า 5" หรือไม่

#         new_array.append(num + 2)
#         # ถ้าตัวเลขมีค่ามากกว่า 5 จริง ให้นำตัวเลขนั้นมาบวก 2 แล้วโยนเข้าไปเก็บในกล่อง new_array 
#         # (หมายเหตุ: ถ้าตัวเลขนั้นน้อยกว่าหรือเท่ากับ 5 เช่น เลข 2 หรือ -12 โปรแกรมจะข้ามไปโดยไม่ทำอะไรเลย)

# print(original_array)
# # พิมพ์ชุดตัวเลขต้นฉบับออกทางหน้าจอ

# print(new_array)
# # พิมพ์ชุดตัวเลขใหม่ (ที่ผ่านการกรองเฉพาะเลขที่มากกว่า 5 และบวก 2 แล้ว) ออกทางหน้าจอ